# SetLWByClass

## Description
Procedure SetLWByClass sets the referenced object to use the class attribute line weight.

```pascal
PROCEDURE SetLWByClass(h : HANDLE);
```

```python
def vs.SetLWByClass(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Sets so that the class line weight is used for the object referenced by h.

## Version
Availability: from VectorWorks8.0

## Category
* Object Attributes